# Pandas

1. Series
2. Data Frames

# 1.Series

Series creation from python list

In [1]:
import pandas as pd

In [2]:
s1=pd.Series([22,33,44,55,66,77,88,99])
s1

0    22
1    33
2    44
3    55
4    66
5    77
6    88
7    99
dtype: int64

In [3]:
s1=pd.Series(["Ameen",'Ali',"Nasir",'Aleem','Abdullah','Iftakhar',"Shadab",'Shaheen'],['one','two','three','four','five','six','seven','eight'])

In [4]:
s1

one         Ameen
two           Ali
three       Nasir
four        Aleem
five     Abdullah
six      Iftakhar
seven      Shadab
eight     Shaheen
dtype: object

In [5]:
s1['six']

'Iftakhar'

In [6]:
s1['two':'seven']

two           Ali
three       Nasir
four        Aleem
five     Abdullah
six      Iftakhar
seven      Shadab
dtype: object

In [7]:
s1[2:7]

three       Nasir
four        Aleem
five     Abdullah
six      Iftakhar
seven      Shadab
dtype: object

In [8]:
s1['two':'seven':2]

two          Ali
four       Aleem
six     Iftakhar
dtype: object

In [9]:
s1['six']='Babar'
s1

one         Ameen
two           Ali
three       Nasir
four        Aleem
five     Abdullah
six         Babar
seven      Shadab
eight     Shaheen
dtype: object

In [10]:
s1['one','two']='Rizwan','Hyder'
s1

one        Rizwan
two         Hyder
three       Nasir
four        Aleem
five     Abdullah
six         Babar
seven      Shadab
eight     Shaheen
dtype: object

In [11]:
s1.values

array(['Rizwan', 'Hyder', 'Nasir', 'Aleem', 'Abdullah', 'Babar', 'Shadab',
       'Shaheen'], dtype=object)

In [12]:
s1.index

Index(['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight'], dtype='object')

In [13]:
s1.index=(['A','B','C','D','E','F','G','H'])
s1

A      Rizwan
B       Hyder
C       Nasir
D       Aleem
E    Abdullah
F       Babar
G      Shadab
H     Shaheen
dtype: object

In [14]:
data=pd.Series({'Karachi':150,'Hyderabad':250,'Thatha':350,'Nawabshah':450})
data

Karachi      150
Hyderabad    250
Thatha       350
Nawabshah    450
dtype: int64

Creating a new series from existing series

In [15]:
city=pd.Series(['Karachi','Lahore','Thatha','Faisalabad'])
s4=pd.Series(data,index=city)
s4

Karachi       150.0
Lahore          NaN
Thatha        350.0
Faisalabad      NaN
dtype: float64

In [16]:
s4.isnull()

Karachi       False
Lahore         True
Thatha        False
Faisalabad     True
dtype: bool

In [17]:
s4[s4.isnull()]

Lahore       NaN
Faisalabad   NaN
dtype: float64

In [18]:
s4.isnull().sum()

2

In [19]:
s4.notnull()

Karachi        True
Lahore        False
Thatha         True
Faisalabad    False
dtype: bool

In [20]:
s4[s4.notnull()]

Karachi    150.0
Thatha     350.0
dtype: float64

In [21]:
s4.notnull().sum()

2

In [22]:
import numpy as np
s5=pd.Series([10,20,30,40,50,60])
s6=pd.Series([np.nan,70,np.nan,80,np.nan,90])

In [23]:
s5

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [24]:
s6

0     NaN
1    70.0
2     NaN
3    80.0
4     NaN
5    90.0
dtype: float64

In [25]:

s5+s6

0      NaN
1     90.0
2      NaN
3    120.0
4      NaN
5    150.0
dtype: float64

In [26]:
s5+s4

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
Faisalabad   NaN
Karachi      NaN
Lahore       NaN
Thatha       NaN
dtype: float64

# 2.Data Frames

In [27]:
data={'City':['Karachi','Islamabad','Rawalpindi','Quetta','Peshawar','Multan'],
      'Year':['2019','2016','2015','2017','2012','2009'],
     'Ratio':[3.4,1.6,2.2,3.4,2.4,1.6]}

In [28]:
df=pd.DataFrame(data)
df

         City  Year  Ratio
0     Karachi  2019    3.4
1   Islamabad  2016    1.6
2  Rawalpindi  2015    2.2
3      Quetta  2017    3.4
4    Peshawar  2012    2.4
5      Multan  2009    1.6

In [29]:
import numpy as np

In [30]:
series1=pd.Series(np.arange(10))
series2=pd.Series(range(11,21))

In [31]:
df=pd.DataFrame({'column1':series1,'column2':series2})
df

   column1  column2
0        0       11
1        1       12
2        2       13
3        3       14
4        4       15
5        5       16
6        6       17
7        7       18
8        8       19
9        9       20

In [32]:
result={'Name':['Abdul Rehman','Abdullah','Nasir','Ali','Ameen'],
        'Roll No':[1010,1020,1030,1040,1050],
         'Math':[84,88,92,76,62],
         'Chemistry':[79,70,67,69,56],
        'Physics':[89,76,72,71,66],
         'English':[69,71,65,62,59]}

In [33]:
df=pd.DataFrame(result)
df

           Name  Roll No  Math  Chemistry  Physics  English
0  Abdul Rehman     1010    84         79       89       69
1      Abdullah     1020    88         70       76       71
2         Nasir     1030    92         67       72       65
3           Ali     1040    76         69       71       62
4         Ameen     1050    62         56       66       59

1. Accessing a complete column
2. Accessing a complete row
3. Adding and removing columns
4. Adding and remving a row
5. Selecting more then one columns
6. Adding more columns to exiting Frame

In [34]:
df['Roll No']

0    1010
1    1020
2    1030
3    1040
4    1050
Name: Roll No, dtype: int64

In [35]:
df.loc[3]

Name          Ali
Roll No      1040
Math           76
Chemistry      69
Physics        71
English        62
Name: 3, dtype: object

In [36]:
df[df['Math']>=80][['Name','Roll No','Math']]

           Name  Roll No  Math
0  Abdul Rehman     1010    84
1      Abdullah     1020    88
2         Nasir     1030    92

In [37]:
df[df["Roll No"]==1050]

    Name  Roll No  Math  Chemistry  Physics  English
4  Ameen     1050    62         56       66       59

In [38]:
df[df['Name'].str.startswith(('n','N'))][['Physics','English','Name']]

   Physics  English   Name
2       72       65  Nasir

In [39]:
df["Total"]=df['Math']+df['Chemistry']+df['Physics']+df['English']
df

           Name  Roll No  Math  Chemistry  Physics  English  Total
0  Abdul Rehman     1010    84         79       89       69    321
1      Abdullah     1020    88         70       76       71    305
2         Nasir     1030    92         67       72       65    296
3           Ali     1040    76         69       71       62    278
4         Ameen     1050    62         56       66       59    243

In [40]:
df['Percentage']=df['Total']*100/400
df

           Name  Roll No  Math  Chemistry  Physics  English  Total  Percentage
0  Abdul Rehman     1010    84         79       89       69    321       80.25
1      Abdullah     1020    88         70       76       71    305       76.25
2         Nasir     1030    92         67       72       65    296       74.00
3           Ali     1040    76         69       71       62    278       69.50
4         Ameen     1050    62         56       66       59    243       60.75

In [41]:
def assignGrade(per):
    grade = None
    if per>=80:
        grade = "A+"
    elif per>=70:
        grade = "A"
    elif per>=60:
        grade = "B"
    elif per>=50:
        grade = "C"
    else:
        grade ="F"
    return grade

In [42]:
df["Grade"]=[assignGrade(per) for per in df['Percentage']]
df

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+
1,Abdullah,1020,88,70,76,71,305,76.25,A
2,Nasir,1030,92,67,72,65,296,74.00,A
3,Ali,1040,76,69,71,62,278,69.50,B
4,Ameen,1050,62,56,66,59,243,60.75,B

In [43]:
df[df['Percentage']>75][['Name','Roll No','Percentage','Grade']]

           Name  Roll No  Percentage Grade
0  Abdul Rehman     1010       80.25    A+
1      Abdullah     1020       76.25     A

In [44]:
df["Percentage"].max()

80.25

In [45]:
df[df["Percentage"]==df["Percentage"].max()][['Name','Roll No','Grade']]

           Name  Roll No Grade
0  Abdul Rehman     1010    A+

In [46]:
df[df["Percentage"]==df["Percentage"].min()][['Name','Roll No','Grade']]

    Name  Roll No Grade
4  Ameen     1050     B

# Drop Entities from an Axis

In [52]:
df.drop(2,axis=0)

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+
1,Abdullah,1020,88,70,76,71,305,76.25,A
3,Ali,1040,76,69,71,62,278,69.50,B
4,Ameen,1050,62,56,66,59,243,60.75,B

In [54]:
df.drop('Roll No',axis=1)

           Name  Math  Chemistry  Physics  English  Total  Percentage Grade
0  Abdul Rehman    84         79       89       69    321       80.25    A+
1      Abdullah    88         70       76       71    305       76.25     A
2         Nasir    92         67       72       65    296       74.00     A
3           Ali    76         69       71       62    278       69.50     B
4         Ameen    62         56       66       59    243       60.75     B

In [57]:
import numpy as np
df["Ratio"]=[2,7,np.nan,6,np.nan]
df

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade,Ratio
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+,2.0
1,Abdullah,1020,88,70,76,71,305,76.25,A,7.0
2,Nasir,1030,92,67,72,65,296,74.00,A,NaN
3,Ali,1040,76,69,71,62,278,69.50,B,6.0
4,Ameen,1050,62,56,66,59,243,60.75,B,NaN

In [59]:
df.dropna() #Drop the row which have nan value

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade,Ratio
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+,2.0
1,Abdullah,1020,88,70,76,71,305,76.25,A,7.0
3,Ali,1040,76,69,71,62,278,69.50,B,6.0

In [63]:
df.dropna(axis=1) #Drop the column which have nan value

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+
1,Abdullah,1020,88,70,76,71,305,76.25,A
2,Nasir,1030,92,67,72,65,296,74.00,A
3,Ali,1040,76,69,71,62,278,69.50,B
4,Ameen,1050,62,56,66,59,243,60.75,B

In [61]:
df.dropna(axis=1,how='any') #Drop the column which have any nan value

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+
1,Abdullah,1020,88,70,76,71,305,76.25,A
2,Nasir,1030,92,67,72,65,296,74.00,A
3,Ali,1040,76,69,71,62,278,69.50,B
4,Ameen,1050,62,56,66,59,243,60.75,B

In [62]:
df.dropna(axis=1,how='all') #Drop the column have all nan values

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade,Ratio
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+,2.0
1,Abdullah,1020,88,70,76,71,305,76.25,A,7.0
2,Nasir,1030,92,67,72,65,296,74.00,A,NaN
3,Ali,1040,76,69,71,62,278,69.50,B,6.0
4,Ameen,1050,62,56,66,59,243,60.75,B,NaN

In [64]:
df.dropna(axis=1,thresh=3) #Drop the column have nan values, greater then or equal to threshhold values

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade,Ratio
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+,2.0
1,Abdullah,1020,88,70,76,71,305,76.25,A,7.0
2,Nasir,1030,92,67,72,65,296,74.00,A,NaN
3,Ali,1040,76,69,71,62,278,69.50,B,6.0
4,Ameen,1050,62,56,66,59,243,60.75,B,NaN

In [70]:
df.dropna(axis=1,thresh=4)

,Name,Roll No,Math,Chemistry,Physics,English,Total,Percentage,Grade
0,Abdul Rehman,1010,84,79,89,69,321,80.25,A+
1,Abdullah,1020,88,70,76,71,305,76.25,A
2,Nasir,1030,92,67,72,65,296,74.00,A
3,Ali,1040,76,69,71,62,278,69.50,B
4,Ameen,1050,62,56,66,59,243,60.75,B

# Selection With loc And iloc

1. loc: wise customized index
2. iloc: integer location index

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame(np.arange(16).reshape(4,4),
               index=['Karachi','Lahore','Islamabad','Abbottabad'],
               columns=['one','two','three','four'])

In [3]:
df

            one  two  three  four
Karachi       0    1      2     3
Lahore        4    5      6     7
Islamabad     8    9     10    11
Abbottabad   12   13     14    15

In [4]:
df.loc['Islamabad']

one       8
two       9
three    10
four     11
Name: Islamabad, dtype: int32

In [5]:
df.iloc[0]

one      0
two      1
three    2
four     3
Name: Karachi, dtype: int32

In [7]:
df.loc['Karachi':'Islamabad','two':'four']

           two  three  four
Karachi      1      2     3
Lahore       5      6     7
Islamabad    9     10    11

In [9]:
df.iloc[1:4,:]

            one  two  three  four
Lahore        4    5      6     7
Islamabad     8    9     10    11
Abbottabad   12   13     14    15

# Arthematic Methods with Fill Values

In [15]:
df1=pd.DataFrame(np.arange(12.).reshape((3,4)),columns=list('ABCD'))
df1

     A    B     C     D
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [17]:
df2=pd.DataFrame(np.arange(20.).reshape(4,5),columns=list('ABCDE'))
df2

      A     B     C     D     E
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [20]:
df3=df1+df2
df3

      A     B     C     D   E
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

# Lambda Function in DataFrame

In [24]:
df2

      A     B     C     D     E
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [29]:
df2.E=df2.E.apply(lambda x:x*10)
df2

      A     B     C     D       E
0   0.0   1.0   2.0   3.0   400.0
1   5.0   6.0   7.0   8.0   900.0
2  10.0  11.0  12.0  13.0  1400.0
3  15.0  16.0  17.0  18.0  1900.0

In [31]:
df2['Status']=df2.E.apply(lambda x: "Perfect" if x%30==0 else "Error")
df2

      A     B     C     D       E   Status
0   0.0   1.0   2.0   3.0   400.0    Error
1   5.0   6.0   7.0   8.0   900.0  Perfect
2  10.0  11.0  12.0  13.0  1400.0    Error
3  15.0  16.0  17.0  18.0  1900.0    Error

In [32]:
employee = pd.DataFrame({'id':['123',np.nan,'124','125','126','127','128'],
                        'employee name':["Kamal","Hassan","Umer",np.nan,'Ali',"Taqi","Zain"],
                        'employee age':[23,34,54,34,21,45,np.nan],
                        "per month salary of employee":[30,np.nan,56,30,89,45,90],
                        "Every employee Depart":["Prod",np.nan,"Supply","Accounts", "Accounts",'Prod',"Prod"],
                        " Employee year of Service":[5,6,7,2,1,9,np.nan]})
employee

,id,employee name,employee age,per month salary of employee,Every employee Depart,Employee year of Service
0,123,Kamal,23.0,30.0,Prod,5.0
1,NaN,Hassan,34.0,NaN,NaN,6.0
2,124,Umer,54.0,56.0,Supply,7.0
3,125,NaN,34.0,30.0,Accounts,2.0
4,126,Ali,21.0,89.0,Accounts,1.0
5,127,Taqi,45.0,45.0,Prod,9.0
6,128,Zain,NaN,90.0,Prod,NaN

In [34]:
employee.columns=['ID','Name','Age','Salary','Departement','Service Years']
employee

    ID    Name   Age  Salary Departement  Service Years
0  123   Kamal  23.0    30.0        Prod            5.0
1  NaN  Hassan  34.0     NaN         NaN            6.0
2  124    Umer  54.0    56.0      Supply            7.0
3  125     NaN  34.0    30.0    Accounts            2.0
4  126     Ali  21.0    89.0    Accounts            1.0
5  127    Taqi  45.0    45.0        Prod            9.0
6  128    Zain   NaN    90.0        Prod            NaN

In [35]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             6 non-null      object
 1   Name           6 non-null      object
 2   Age            6 non-null      float64
 3   Salary         6 non-null      float64
 4   Departement    6 non-null      object
 5   Service Years  6 non-null      float64
dtypes: float64(3), object(3)
memory usage: 464.0+ bytes

In [36]:
employee.describe()

             Age     Salary  Service Years
count   6.000000   6.000000        6.00000
mean   35.166667  56.666667        5.00000
std    12.671490  27.259249        3.03315
min    21.000000  30.000000        1.00000
25%    25.750000  33.750000        2.75000
50%    34.000000  50.500000        5.50000
75%    42.250000  80.750000        6.75000
max    54.000000  90.000000        9.00000